In [22]:
import pandas as pd 
import numpy as np

In [23]:
# 일단 데이터형태부터 파악한후 작업 진행 
sales_2017 = pd.read_csv('./data/Content_Sales_2017.csv', header=1, encoding='euc-kr')

In [24]:
sales_2017_location = sales_2017.iloc[:,[1]]
sales_2017['행정구역'] = sales_2017_location
sales_2017.head(10)

In [5]:
# - 포함 삭제 해야함 혹은 0으로 
sales_2017.replace('-', 0 ,inplace=True)

In [6]:
# a = sales_2017.iloc[:,2:3]
# b = sales_2017.iloc[:,8:-5]

In [7]:
sales_2017.출판.dtype , sales_2017['출판.1'].dtype

(dtype('O'), dtype('int64'))

In [8]:
print(sales_2017.합계.dtype)

object

In [9]:
sales_2017['합계']= sales_2017['합계'].astype(int)
sales_2017['출판']= sales_2017['출판'].astype(int)
sales_2017['만화']= sales_2017['만화'].astype(int)
sales_2017['음악']= sales_2017['음악'].astype(int)
sales_2017['영화']= sales_2017['영화'].astype(int)

In [10]:
sales_2017['2017 합계']= sales_2017['합계'] + sales_2017['합계.1']
sales_2017['2017 출판']= sales_2017['출판'] + sales_2017['출판.1']+sales_2017['만화'] + sales_2017['만화.1']
sales_2017['2017 음악']= sales_2017['음악'] + sales_2017['음악.1']
sales_2017['2017 영화']= sales_2017['영화'] + sales_2017['영화.1']

In [11]:
sales_2017.shape

(18, 18)

In [12]:
sales_2017 = sales_2017.iloc[:,-4:]

In [13]:
sales_2017.head(5)

     2017 합계   2017 출판   2017 음악   2017 영화
0  218368863  43579697  11112547  10750751
1  141681676  24374179   7220061   6487826
2    5407634   1150819    404114    438316
3    3901184    854476    419827    283562
4    3152666    874065    239183    262798

In [14]:
# sales.columns
# 컬럼명 변경 
col = {
        sales_2017.columns[0]:'합계',
        sales_2017.columns[1]:'출판',
        sales_2017.columns[2]:'음악',
        sales_2017.columns[3]:'영화',
      }

# 변경
sales_2017.rename(columns= col, inplace= True)

In [19]:
sales_2017

           합계        출판        음악        영화 행정구역
0   218368863  43579697  11112547  10750751   소계
1   141681676  24374179   7220061   6487826   소계
2     5407634   1150819    404114    438316   부산
3     3901184    854476    419827    283562   대구
4     3152666    874065    239183    262798   인천
5     1981661    601827     47777    180497   광주
6     2626975    513481     68769    186110   대전
7     1142127    282279     78130    111612   울산
8       70431     30013      9015     11469   세종
9    44573732  12635334   1786200   1724191   경기
10    1178219    164209    133573    125556   강원
11    1700396    178330     62592    127942   충북
12    1696150    422531     76301    154162   충남
13    1308751    230359     80886    146640   전북
14     847541    103942     90001     78803   전남
15    1919187    611824    141189    137415   경북
16    2882680    460462    230183    245565   경남
17    2297855     91567     24747     48287   제주